#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
aws_s3_bucket.main_bucket: Refreshing state... [id=corentin-ducatez-resume-bucket-6-merge]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.policy_allow_public_access will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "policy_allow_public_access" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + resources = [
              + "arn:aws:s3:::corentin-ducatez-resume-bucket-6-merge/*",
            ]

          + principals {
              + identifiers = [
                  + "*",
                ]
              + type        = "*"
            }
        }
    }

  # aws_s3_bucket.main_bucket will be updated in-place
  ~ resource "aws_s3_bucket" "main_bucket" {
      + force_destroy               = true
        id                          = "corentin-ducatez-resume-bucket-6-merge"
        tags                        = {}
        # (11 unchanged attributes hidden)



        # (4 unchanged blocks hidden)
    }

  # aws_s3_bucket_acl.bucket_acl will be created
  + resource "aws_s3_bucket_acl" "bucket_acl" {
      + acl    = "public-read"
      + bucket = "corentin-ducatez-resume-bucket-6-merge"
      + id     = (known after apply)

      + access_control_policy {
          + grant {
              + permission = (known after apply)

              + grantee {
                  + display_name  = (known after apply)
                  + email_address = (known after apply)
                  + id            = (known after apply)
                  + type          = (known after apply)
                  + uri           = (known after apply)
                }
            }

          + owner {
              + display_name = (known after apply)
              + id           = (known after apply)
            }
        }
    }

  # aws_s3_bucket_policy.policy_allow_public_access will be created
  + resource "aws_s3_bucket_policy" "policy_allow_public_access" {
      + bucket = "corentin-ducatez-resume-bucket-6-merge"
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # aws_s3_bucket_versioning.versioning_enabled will be created
  + resource "aws_s3_bucket_versioning" "versioning_enabled" {
      + bucket = "corentin-ducatez-resume-bucket-6-merge"
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

  # aws_s3_bucket_website_configuration.bucket_website_configuration will be created
  + resource "aws_s3_bucket_website_configuration" "bucket_website_configuration" {
      + bucket           = "corentin-ducatez-resume-bucket-6-merge"
      + id               = (known after apply)
      + routing_rules    = (known after apply)
      + website_domain   = (known after apply)
      + website_endpoint = (known after apply)

      + error_document {
          + key = "404.html"
        }

      + index_document {
          + suffix = "index.html"
        }

      + routing_rule {
          + condition {
              + http_error_code_returned_equals = (known after apply)
              + key_prefix_equals               = (known after apply)
            }

          + redirect {
              + host_name               = (known after apply)
              + http_redirect_code      = (known after apply)
              + protocol                = (known after apply)
              + replace_key_prefix_with = (known after apply)
              + replace_key_with        = (known after apply)
            }
        }
    }

Plan: 4 to add, 1 to change, 0 to destroy.

Changes to Outputs:
  + website_endpoint = "corentin-ducatez-resume-bucket-6-merge.s3-website.eu-west-3.amazonaws.com"

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.


```

</details>

*Pushed by: @Wasta-Geek, Action: `pull_request`*